# DBShowDBTableDlg

## Description
Show the specified database table dialog.

```pascal
FUNCTION DBShowDBTableDlg(
				database : STRING;
				table    : STRING) : BOOLEAN;
```

```python

def vs.DBShowDBTableDlg(database, table):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|database|STRING||
|table|STRING||

## Version
Availability: from Vectorworks 2011
## Category
* ODBC